source("./src/01_libraries.R")


############################################################
# 첫 페이지 메인 로지컬 넘버들 dt

all_frame = fread("./out/all_frame.csv")
all_frame = as.data.frame(all_frame)

all_frame_dt = datatable(all_frame, filter = 'top',extensions = c('Scroller', 'Buttons'), options = list(
  deferRender = TRUE,
  scrollY = 700,
  scroller = TRUE,
  dom = 'Bfrtip',
  buttons = c('copy', 'excel')
  
))


############################################################
# 두번째 페이지 Power Writer dt


############################################################
# 세번쨰 페이지 Best Replier dt


############################################################
# 네번째 페이지 Populart Poster dt

############################################################


############################################################


############################################################


############################################################


############################################################


